app/controllers/users_page_controller.rb

INSERT INTO "users" ("username", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "bidfvdfvdfvdf"], ["bio", " "], ["created_at", "2018-07-31 20:52:33.607186"], ["updated_at", "2018-07-31 20:52:33.607186"]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "bidfvdfvdfvdf"], ["LIMIT", 1]]
---
	def new

	  @user = User.new()
    @user.username = params[:name]
    @user.bio = params[:bio]


    @user.save
    if @user.username.include?(" ")
      redirect_to "/error"
    elsif @user.id != nil


      redirect_to "/users/#{User.last.username}"

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "bidfvdfvdfvdf"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "alo"], ["LIMIT", 1]]
---
  def show

    @username = params[:username]
    @id = User.find_by(username: @username).id
    @bio = User.find_by(username: @username).bio